## Retrieve Data

In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('./friend_list.csv') # csv 파일 불러오기

In [6]:
df # name,age,job (header)

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [7]:
 df1 = pd.read_csv('./friend_list.txt') # txt 파일 불러오기 (,구분)

In [8]:
df1

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
df2 = pd.read_csv('./friend_list_tab.txt',delimiter='\t') # txt 파일 불러오기 (tab구분)

In [12]:
df2

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
df3 = pd.read_csv('./friend_list_no_head.csv')

In [15]:
df3 # 첫번째 행에 데이터가 들어있다.

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [16]:
df3 = pd.read_csv('./friend_list_no_head.csv',header=None) # header가 없는 경우

In [17]:
df3

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [19]:
df3.columns = ['name','age','job'] # header에 변수명 지정

In [20]:
df3

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [21]:
df3 = pd.read_csv('./friend_list_no_head.csv',header=None,names=['name','age','job']) # 2step -> 1step

In [22]:
df3

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern